# CutLineExtension Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CutMarkType..::..CutLineExtension Property
CutMarkType Class See Also
---
The extension distance to the boundary.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double CutLineExtension { get; set; }
```

Visual Basic
---
```text
Public Property CutLineExtension As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CutLineExtension {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for extensionDistanceToBoundary must be between 0 and 30000 feet. |

# See Also
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace